Revit 2024 API
ReferenceIntersector.TargetType Property
 The type of reference to find.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public FindReferenceTarget TargetType { get; set; }
Visual Basic
Public Property TargetType As FindReferenceTarget
	Get
	Set
Visual C++
public:
property FindReferenceTarget TargetType {
	FindReferenceTarget get ();
	void set (FindReferenceTarget value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ReferenceIntersector Class
Autodesk.Revit.DB Namespace